{
  "CHANNEL_CREATE_PK_NOT_VALID": "The public encryption key your browser sent us doesn't appear to be valid. Please Try again or contact us!",
  "CHANNEL_CREATE_OWNER_NOT_MATCH": "The channel owner doesn't exist or match Hive records. Please try again or contact us!",
  "CHANNEL_CREATE_OWNER_ERROR_FIND": "We encountered an error whilst trying to find the owner, this could mean the nodes we use are down.",
  "CHANNEL_CREATE_EMPTY_NAME": "We can't create channels with empty names, sorry!",
  "CHANNEL_CREATE_LONG_NAME": "You can't have a channel name which is more than 50 characters, sorry!",
  "CHANNEL_CREATE_ERROR_SQL": "Error Saving Channel. Please Try Again Later.",
  "CHANNEL_CREATE_SUCCESS": "Successfully created channel!",
  "INVITE_UPLOAD_FIELD_WRONG_LENGTH": "Sorry, this invite has an invalid field (by length/formatting) this is likely a programming error. Please contact us!",
  "INVITE_UPLOAD_HASH_WRONG": "The Invite Hash You've provided seems to be wrong. Try regenerating it and if it still doesn't work, contact us!",
  "INVITE_UPLOAD_ERROR_FIND_CREATOR": "We couldn't find the link's creator on Hive, either hive is down or you don't exist 😲 (or I wrote some bad code)",
  "INVITE_UPLOAD_ERROR_EXPIRES": "This invite has already expired or isn't a date.",
  "INVITE_UPLOAD_EXPIRE": "This invite has already expired.",
  "INVITE_UPLOAD_ENCRYPTED_WRONG": "This invite wasn't encoded properly after encryption or some data was lost. Please try again.",
  "INVITE_UPLOAD_EXTRA_BYTES_MISSING": "You didn't send extra bytes, these are needed for security reasons. Please try again.",
  "INVITE_UPLOAD_SUCCESS": "Invite created.",
  "INVITE_SQL_FAIL": "Couldn't connect to the database to insert invite. Please try again with a new link",
  "INVITE_UPLOAD_CHANNEL_NOT_EXIST": "Channel doesn't exist.",
  "SIGNATURE_USER_KEY_NOT_EXIST": "We couldn't find the User Specified to verify this transaction.",
  "SIGNATURE_NOT_DECODE": "A signature couldn't be decoded.",
  "SIGNATURE_KEYS_NOT_MEET_THRESHOLD": "Your account is multi signature, and you haven't provided enough signatures to prove ownership.",
  "TRANSACTION_NO_SIGNERS": "We couldn't read any of the operations to find signers, so this transaction was dropped.",
  "TRANSACTION_ERROR": "Error processing transaction. Please try again.",
  "RECEIVED_TOO_LATE": "This transaction took over 20 Minutes to be received by the server, so we can't send it. Please resend it.",
  "TRANSACTION_NONCE_USER_NONE": "We couldn't work out what user some of the operations belong to, and so we can't work out your next nonce.",
  "NOT_A_WRAPPED_TRANSACTION": "This transaction is not in the correct format for us to be able to respond to it. Rejected.",
  "TRANSACTION_ERROR_BAD_JSON": "Couldn't decode this transaction. Is it valid JSON?"
}